
{
  "category": "Shafts, Ball Screws & Supports",
  "products": [
    {
      "name": "Linear Shaft",
      "tech_tier": "Core Component",
      "size_range": "Ø3 - Ø100 mm",
      "key_features": "Hard chrome plated, high hardness (60-65 RC), high straightness (0.1 mm/m).",
      "materials": "EN-8/Ck45, SUS440C equivalent (stainless steel, alloy steel, carbon steel, aluminum, composite materials, plastics).",
      "applications": "Mating component for all linear motion bearings, industrial machinery, automation systems, 3D printers, and medical equipment.",
      "differentiator": "High surface hardness and precision grinding ensures long bearing life and smooth motion, with excellent wear resistance and dimensional stability.",
      "image": "https://thmhuade.com/wp-content/uploads/2020/07/linear-shaft-300x300.jpg",
      "specifications": {
        "hardness": "Typically 50-79 Rockwell C (often case hardened to 58 HRC or higher)",
        "surface_finish": "Smooth (e.g., 0.15 μm to 0.3 μm Ra for recirculating ball bearings)",
        "coatings": "Anodizing, black oxide, ceramic, chromium, electroless nickel, Teflon (PTFE)"
      }
    },
    {
      "name": "Shaft Support Rails",
      "tech_tier": "Core Component",
      "size_range": "Ø12 - Ø80 mm",
      "key_features": "Fully supported shaft prevents deflection over long spans. Available in round, profile/square, and continuous support types.",
      "materials": "Carbon steel, stainless steel, aluminum alloy (sometimes ceramic-coated aluminum).",
      "applications": "Long-travel linear systems where shaft sag would otherwise be an issue, industrial machinery, automation systems.",
      "differentiator": "Provides continuous support for maximum rigidity and accuracy, accommodating higher loads and preventing binding.",
      "image": "https://thmhuade.com/wp-content/uploads/2020/07/shaft-support-rails-300x300.jpg",
      "specifications": {
        "hardness": "Typically RC60 for steel shafts, RC50 for stainless steel, RC70 for ceramic-coated aluminum",
        "length": "Up to 4 meters (end-joinable for extended travel)",
        "compatibility": "Designed to work with various linear bearings including open type ball bushings, plain bearings, or roller bearings."
      }
    },
    {
      "name": "Shaft End Supports",
      "tech_tier": "Core Component",
      "size_range": "Ø8 - Ø60 mm",
      "key_features": "Clamping-style aluminum blocks for securing shaft ends. Available in flanged, T-shaped, L-shaped, square, and round forms.",
      "materials": "Aluminum alloy (e.g., 6061-T6, 7075), cast iron, steel (e.g., 304, 316, carbon).",
      "applications": "Mounting and fixing the ends of linear shafts in a machine frame, minimizing deflection and vibration.",
      "differentiator": "Simple and effective way to mount and align linear shafting, with various tightening methods and material options.",
      "image": "https://thmhuade.com/wp-content/uploads/2020/07/shaft-end-supports-300x300.jpg",
      "specifications": {
        "tightening_methods": "Slit/side slit, split, set screw, hinge type",
        "mounting_options": "Flanged, pillow blocks, compact type, wide type, split type, bottom mount"
      }
    },
    {
      "name": "Precision Ball Screw",
      "tech_tier": "Better/Best",
      "size_range": "Ø12 - Ø100 mm",
      "key_features": "Gothic arch groove profile for high rigidity, low friction, no backlash with preload. High accuracy and repeatability.",
      "materials": "High alloy steel or stainless steel (often heat-treated to 60 ± 2 HRC).",
      "applications": "Precise positioning systems in CNC machines, actuators, robotics, and medical devices.",
      "differentiator": "High working efficiency (1/3 torque of ACME), high accuracy and reliability, with minimal backlash.",
      "image": "https://thmhuade.com/wp-content/uploads/2020/07/precision-ball-screw-300x300.jpg",
      "specifications": {
        "accuracy_grades": "JIS C0-C10 (C0 highest), ISO 1-10 (1 highest)",
        "lead_accuracy_parameters": "eₚ (average lead deviation), νᵤ (max deviation range), ν₃₀₀ (max deviation over 300mm), ν₂π (lead wobble)",
        "backlash_reduction_methods": "Selective fit, preloading (oversized balls, spring assembly)"
      }
    },
    {
      "name": "Ball Screw Support Units",
      "tech_tier": "System Component",
      "size_range": "For Ø10 - Ø40 mm screws",
      "key_features": "Pre-assembled units with high-precision angular contact bearings. Fixed (BK/FK, EK) and Supported (BF/FF, EF) side units.",
      "materials": "Burnished steel (for housings), stainless steel or ceramic hybrid (for bearings).",
      "applications": "Securing the ends of a ball screw assembly, providing rigid support and alignment in industrial applications.",
      "differentiator": "Simplifies design and assembly of ball screw systems, ensures proper bearing preload, and minimizes vibration and deflection.",
      "image": "https://thmhuade.com/wp-content/uploads/2020/07/ball-screw-support-units-300x300.jpg",
      "specifications": {
        "bearing_types": "Angular contact ball bearings (preloaded), deep groove radial bearings",
        "mounting_types": "Block (square), flanged, convex",
        "lubrication": "Sealed and pre-greased for lifetime lubrication"
      }
    }
  ]
}
