{
  "category": "Valves",
  "subcategories": [
    {
      "name": "Directional Control Valves",
      "products": [
        {
          "name": "HD-WE Solenoid Operated Spool Valve",
          "tech_tier": "Entry to Mid",
          "size_interface": "NG6 (D03), NG10",
          "control": "Solenoid / electro-hydraulic",
          "features": "Direct solenoid-operated, wet pin DC or AC solenoids with removable coils.",
          "applications": "Industrial automation, machinery manufacturing, aerospace projects, marine applications, machine tools, plastic molding machines, and pressing machines.",
          "differentiator": "Coils can be replaced without opening the pressure-tight chamber. Optional manual override.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-WE-solenoid-operated-spool-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 120 L/min",
            "standards": "DIN 24 340 form A, ISO 4401, CETOP-RP 121H"
          }
        },
        {
          "name": "HD-M-SEW6/10 Solenoid Actuated Poppet Valve",
          "tech_tier": "Mid to High",
          "size_interface": "NG6, NG10",
          "control": "Solenoid actuated",
          "features": "Leak-free closed port design with direct solenoid operation for precise control. Air-gap DC solenoid with removable coil for easy maintenance and service. Maximum operating pressure up to 630 bar with flow rate up to 25 L/min (HD-M-SEW6). Available in multiple configurations: 2/2-way, 3/2-way (normally closed or normally open), and 4/2-way with sandwich plate. Compliant with DIN 24 340 Form A, ISO 4401, and CETOP-RP 121H standards. Robust and reliable for high-pressure hydraulic systems.",
          "applications": "Hydraulic applications such as injection molding machines, machine tools, automation equipment, construction machinery, presses, forming machines, industrial automation systems, and hydraulic test benches.",
          "differentiator": "Leak-free design, robust and reliable for high-pressure systems.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-M-SEW-solenoid-actuated-poppet-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 630 bar",
            "max_flow_rate": "25 L/min (for HD-M-SEW6)",
            "standards": "DIN 24 340 Form A, ISO 4401, CETOP-RP 121H",
            "configurations": "2/2-way, 3/2-way (normally closed or normally open), 4/2-way with sandwich plate"
          }
        },
        {
          "name": "HD-(H)-WEH/WH Pilot Operated Directional Valve",
          "tech_tier": "High",
          "size_interface": "NG10, NG16, NG25, NG32",
          "control": "Electro-hydraulic (WEH) or hydraulic (WH)",
          "features": "Pilot operated directional valve with subplate mounting for flexible installation. Available with optional wet-pin DC or AC solenoids for versatile control options. Manual override and shifting time adjustment for enhanced operational flexibility. High flow rate capability up to 1100 L/min with maximum operating pressure up to 350 bar. Compliant with DIN 24 340 form A, ISO 4401, and CETOP-RP 121H standards. Various optional features enable customized control for specific application requirements.",
          "applications": "General hydraulic systems, machine tools, plastic injection molding machines.",
          "differentiator": "High flow rates, various optional features for customized control.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-H-WEH-WH-pilot-operated-directional-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 1100 L/min",
            "standards": "DIN 24 340 form A, ISO 4401, CETOP-RP 121H"
          }
        },
        {
          "name": "P40/P80/P120 Monoblock Manually Controlled Valve",
          "tech_tier": "Entry to Mid",
          "size_interface": "P40, P80, P120 nominal flow rates",
          "control": "Manual (lever), with options for cable, solenoid, pneumatic, electro-hydraulic control",
          "features": "Monoblock construction accommodating 1-7 spools for versatile system configurations. Available in parallel or series function arrangements with optional integrated safety valve. Manual lever control with options for cable, solenoid, pneumatic, or electro-hydraulic actuation. P40: 40 L/min at 315 bar, P80: 80 L/min at 250 bar, P120: 120 L/min nominal flow. Fluid temperature range from -10째C to +80째C. Compact, reliable, and economical solution for mobile and industrial hydraulic control.",
          "applications": "Mobile equipment like tractors, excavators, and loaders, as well as various industrial machinery.",
          "differentiator": "Compact, reliable, and economical solution for hydraulic fluid control.",
          "image": "https://thmhuade.com/wp-content/uploads/2021/02/P80-Monoblock-Manually-Controlled-Valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar (P40), 250 bar (P80)",
            "nominal_flow_rate": "40 L/min (P40), 80 L/min (P80), 120 L/min (P120)",
            "fluid_temperature_range": "-10째C to +80째C"
          }
        },
        {
          "name": "HD-LC 2-way Cartridge Valve",
          "tech_tier": "High",
          "size_interface": "NG16 to NG160",
          "control": "Logic element for compact block designs",
          "features": "Versatile 2-way cartridge valve serving as logic element for compact hydraulic block designs. Available with poppet with or without damping nose for controlled actuation. Multiple area ratios, various spring options, and stroke limiters enable precise customization. Maximum operating pressure up to 420 bar with exceptional flow capacity up to 7000 L/min. Compliant with DIN 24342 standard. Suitable for directional control, pressure control (relief or reducing), and flow control applications.",
          "applications": "Directional control, pressure control (relief or reducing), and flow control.",
          "differentiator": "Versatile logic elements for compact hydraulic systems.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-LC-2-way-cartridge-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 420 bar",
            "max_flow_rate": "Up to 7000 L/min",
            "standards": "DIN 24342"
          }
        }
      ]
    },
    {
      "products": [
        {
          "name": "HD-S Check Free Flow Valve",
          "tech_tier": "Entry",
          "size_interface": "6, 8, 10, 15, 20, 25, 30 inches",
          "control": "Free flow in one direction, leakage-free closure in the opposite direction.",
          "features": "Check valve allowing free flow in one direction with leakage-free closure in the opposite direction. Available with threaded (screw-in) connection or subplate mounting for installation flexibility. Various cracking pressure options to suit different system requirements. Constructed from high-strength materials providing excellent resistance to friction, corrosion, and deformation. Maximum operating pressure up to 315 bar with flow rate capacity up to 450 L/min. Ensures reliable unidirectional flow and prevents backflow in diverse industrial applications.",
          "applications": "Fluid flow control in diverse industrial applications to ensure unidirectional flow and prevent backflow.",
          "differentiator": "High-strength materials for friction, corrosion, and deformation resistance.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-S-check-free-flow-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 450 L/min"
          }
        },
        {
          "name": "HD-SV/SL Hydraulically Pilot Operated Check Valve",
          "tech_tier": "Mid",
          "size_interface": "NG10, NG20, NG30",
          "control": "Allows free flow in one direction and blocks flow in the opposite direction until pilot pressure is applied.",
          "features": "Hydraulically pilot operated check valve combining standard check valve function with externally controllable bypass. Allows free flow in one direction and blocks reverse flow until pilot pressure is applied for controlled release. Subplate mounting with optional pre-opening feature for dampened decompression and shock prevention. Maximum operating pressure up to 315 bar with flow rate up to 400 L/min. Compliant with DIN 24 340, ISO 4401, and CETOP-RP 121H3 standards. Provides flexible and safe operation for load holding and controlled lowering applications.",
          "applications": "Hydraulic presses, lifting equipment, injection molding machines.",
          "differentiator": "Combines check valve function with an externally controllable bypass for flexible and safe operation.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-SV-SL-hydraulically-pilot-operated-check-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 400 L/min",
            "standards": "DIN 24 340, ISO 4401, CETOP-RP 121H3"
          }
        },
        {
          "name": "HD-RVP Check Valve, Sub-plate Mounting",
          "tech_tier": "Entry to Mid",
          "size_interface": "NG6 to NG40",
          "control": "Leakage-free closure in one direction, free flow in the opposite direction.",
          "features": "Sub-plate mounted check valve with poppet design for leakage-free closure in one direction and free flow in the opposite direction. Low opening pressure of 0.05 MPa for minimal flow restriction. Maximum operating pressure up to 315 bar with flow rate capacity up to 600 L/min. Compatible with Rexroth products for easy integration into existing systems. Dependable flow control ideal for use as back pressure valve or bypass valve at pump outlets.",
          "applications": "Back pressure valve or bypass valve at the outlet of a pump.",
          "differentiator": "Dependable flow control, compatible with Rexroth products.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-RVP-check-valve-sub-plate-mounting-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 600 L/min",
            "opening_pressure": "0.05 MPa"
          }
        },
        {
          "name": "HD-Z1S Sandwich Plate Check Valve",
          "tech_tier": "Mid",
          "size_interface": "NG6, NG10",
          "control": "Direct-operated check valve for vertical stacking assemblies.",
          "features": "Direct-operated sandwich plate check valve designed for compact vertical stacking assemblies. Available with 8 different isolating functions and various cracking pressure options for application flexibility. High-performance plastic poppet ensures excellent leak-tightness even under demanding conditions. Maximum operating pressure up to 350 bar (35.0 MPa) with flow rate up to 100 L/min. Compliant with ISO 4401 standard. Cost-effective replacement for Rexroth components suitable for high-pressure, high-velocity industrial applications.",
          "applications": "Industrial applications requiring operating pressures above 10.0 MPa and flow velocities exceeding 4 m/s.",
          "differentiator": "Leak-tightness through high-performance plastic poppet, cost-effective replacement for Rexroth components.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-Z1S-sandwich-plate-check-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 100 L/min",
            "standards": "ISO 4401"
          }
        },
        {
          "name": "HD-Z2S Pilot Operated Check Valve, Sandwich Plate",
          "tech_tier": "Mid to High",
          "size_interface": "NG6, NG10, NG16, NG22",
          "control": "Hydraulically pilot-operated check valve for vertical stacking assemblies.",
          "features": "Hydraulically pilot-operated sandwich plate check valve for compact vertical stacking assemblies. Provides leakage-free closure of one or two actuator ports even over extended periods. Optional pre-opening feature for controlled decompression. Maximum operating pressure up to 315 bar with flow rate capacity up to 450 L/min. Compliant with DIN 24 340 form A, ISO 4401, and CETOP-RP 121H standards. Compatible replacement for Rexroth's equivalent range with reliable load holding capabilities.",
          "applications": "Various industrial equipment requiring leakage-free blocking of actuator ports.",
          "differentiator": "Provides leakage-free closure even over long periods, can replace Rexroth's equivalent range.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-Z2S-pilot-operated-check-valve-sandwich-plate-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 450 L/min",
            "standards": "DIN 24 340 form A, ISO 4401, CETOP-RP 121H"
          }
        }
      ]
    },
    {
      "name": "Pressure Valves",
      "products": [
        {
          "name": "HD-DB...50/ Pilot Operated Pressure Relief Valve",
          "tech_tier": "High",
          "size_interface": "NG10 to NG30",
          "control": "Pilot-operated pressure relief",
          "features": "Pilot-operated pressure relief valve with poppet structure for accurate pressure control. Multiple pressure adjustment elements accommodate various system requirements. Available in multiple mounting configurations including sub-plate, threaded, and manifold for installation flexibility. Pressure range options: 50, 100, 200, 315, and 350 bar. Maximum operating pressure up to 350 bar with flow rate up to 650 L/min. Optional solenoid-operated unloading (HD-DBW) for remote control. Limits and controls system pressure for aerospace, equipment engineering, mining, chemical, machine tools, and marine applications.",
          "applications": "Aerospace, equipment engineering, mining, chemical manufacturing, machine tools, marine steering gear hydraulic systems, swing crane hydraulic systems, and pitch control systems.",
          "differentiator": "Limits or controls pressure in a hydraulic system, with optional solenoid-operated unloading (HD-DBW).",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DB-pilot-operated-pressure-relief-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 650 L/min",
            "pressure_ranges": "50, 100, 200, 315, and 350 bar"
          }
        },
        {
          "name": "HD-DBD Direct Operated Pressure Relief Valve",
          "tech_tier": "Entry to Mid",
          "size_interface": "NG6 to NG30",
          "control": "Direct-operated pressure relief",
          "features": "Direct-operated poppet valve providing infinitely variable pressure adjustment for precise system protection. Various pressure adjustment options including rotary knob and hex head screw for ease of setting. Multiple mounting configurations available: cartridge, threaded, and subplate for installation versatility. Maximum operating pressure up to 400 bar. Compatible replacement for Rexroth DBD series. Suitable for engineering, construction machinery, metallurgy, machine tools, and aerospace applications requiring reliable pressure relief.",
          "applications": "Engineering, construction machinery, metallurgy, machine tools, and aerospace.",
          "differentiator": "Infinitely variable pressure adjustment, can replace Rexroth DBD series.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DBD-direct-operated-pressure-relief-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 400 bar"
          }
        },
        {
          "name": "HD-DR...DP Direct Operated Pressure Reducing Valve, 3-Port",
          "tech_tier": "Mid",
          "size_interface": "NG6, NG10",
          "control": "Direct-operated pressure reducing",
          "features": "Direct-operated 3-port pressure reducing valve with integrated pressure relief function on the secondary side. Subplate mounting with various adjustment elements for precise pressure control. Optional check valve enables free return flow when needed. Pressure range options: 25, 75, 150, 210, and 315 bar. Maximum operating pressure up to 315 bar with flow rate up to 80 L/min. Compliant with DIN 24 340 form D, ISO 5781, and CETOP-RP 121H standards. Reduces and maintains consistent secondary pressure for industrial pressure control, handling equipment, construction machinery, lathes, ship hydraulics, mining, metallurgy, and chemical applications.",
          "applications": "Industrial pressure control, handling equipment, construction machinery, lathes, ship hydraulic systems, mining, metallurgy, and chemical sectors.",
          "differentiator": "Reduces system pressure with a pressure relief function on the secondary side.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DR-DP-direct-operated-pressure-reducing-valve-3-port-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 80 L/min",
            "pressure_ranges": "25, 75, 150, 210, and 315 bar",
            "standards": "DIN 24 340, form D, ISO 5781, CETOP-RP 121H"
          }
        },
        {
          "name": "HD-DR Pilot Operated Pressure Reducing Valve",
          "tech_tier": "High",
          "size_interface": "NG10, NG20, NG30",
          "control": "Pilot-operated pressure reducing",
          "features": "Pilot-operated pressure reducing valve providing smooth and quick pressure regulation for enhanced system efficiency. Available with sub-plate mounting and threaded connection options. Four types of pressure adjustment elements accommodate various application requirements. Optional check valve for reverse flow capability. Pressure range options: 50, 100, 200, and 315 bar. Maximum operating pressure up to 315 bar with flow rate up to 400 L/min. Designed for heavy-duty applications in construction, industrial and mobile equipment, machine tools, aerospace, marine steering systems, swing cranes, and pitch control systems.",
          "applications": "Heavy-duty use in construction, industrial and mobile equipment, machine tools, aerospace, marine steering gear hydraulic systems, swing crane hydraulic systems, and pitch control systems.",
          "differentiator": "Smooth and quick pressure regulation for enhanced hydraulic efficiency and system protection.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DR-pilot-operated-pressure-reducing-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 400 L/min",
            "pressure_ranges": "50, 100, 200, and 315 bar"
          }
        },
        {
          "name": "HD-ZDB/Z2DB Pilot Operated Pressure Relief, Sandwich Plate",
          "tech_tier": "High",
          "size_interface": "NG6, NG10",
          "control": "Pilot-operated pressure relief",
          "features": "Pilot-operated pressure relief valve in compact sandwich plate design for vertical stacking assemblies. Available with one or two pressure relief cartridges for single or dual circuit protection. Various adjustment elements enable precise pressure setting. Pressure range options: 50, 100, 200, and 315 bar. Maximum operating pressure up to 315 bar with flow rate up to 100 L/min. Compliant with DIN 24 340 form A, ISO 4401, and CETOP-RP 121H standards. Limits system pressure with space-saving design for general hydraulic applications.",
          "applications": "General hydraulic systems.",
          "differentiator": "Limits the pressure within a hydraulic system, with a compact sandwich plate design.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-ZDB-Z2DB-pilot-operated-pressure-relief-sandwich-plate-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 100 L/min",
            "pressure_ranges": "50, 100, 200, and 315 bar",
            "standards": "DIN 24 340 form A, ISO 4401, CETOP-RP 121H"
          }
        },
        {
          "name": "HD-ZDR Direct Operated Pressure Reducing, Sandwich Plate",
          "tech_tier": "Mid",
          "size_interface": "NG6, NG10",
          "control": "Direct-operated pressure reducing",
          "features": "Direct-operated pressure reducing valve in compact sandwich plate design for space-saving installations. Reduces system pressure with integrated pressure relief function on the secondary side. Available with 4 pressure levels/ratings: 25, 75, 150, 210, and 315 bar. Various adjustment elements for precise control. Optional check valve for reverse flow capability. Maximum operating pressure up to 350 bar with flow rate up to 160 L/min. Compliant with ISO 4401-03-02-0-05 and DIN 24340 form A standards. Suitable for general hydraulic systems requiring secondary pressure reduction.",
          "applications": "General hydraulic systems.",
          "differentiator": "Reduces system pressure with a pressure relief function on the secondary side, compact design.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-ZDR-direct-operated-pressure-reducing-sandwich-plate-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 160 L/min",
            "pressure_settings": "25, 75, 150, 210, and 315 bar",
            "standards": "ISO 4401-03-02-0-05, DIN 24340 form A"
          }
        }
      ]
    },
    {
      "name": "Proportional Valves",
      "products": [
        {
          "name": "HD-2FRE Proportional Flow Control Valve, 2-Way",
          "tech_tier": "High",
          "size_interface": "NG6, NG10, NG16",
          "control": "Proportional solenoid",
          "features": "Proportional 2-way flow control valve regulating flow based on electrical command value. Pressure-compensated design maintains constant flow regardless of varying load pressures. Electrical position feedback for closed-loop control accuracy. Sub-plate mounting for flexible installation. Maximum operating pressure up to 315 bar with flow rate up to 160 L/min. Ideal for precise flow regulation in industrial equipment, chemical processing, and mining applications requiring repeatable, electronically controlled flow.",
          "applications": "Industrial equipment, chemical processing, and mining.",
          "differentiator": "Regulates flow based on an electrical command value, with constant flow even with varying load pressures.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-2FRE-proportional-flow-control-valve-2-way-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 160 L/min"
          }
        },
        {
          "name": "HD-4WR Pilot Operated Proportional Directional Valve",
          "tech_tier": "High",
          "size_interface": "NG10, NG16, NG25, NG32",
          "control": "Pilot-operated proportional solenoid",
          "features": "Pilot-operated proportional directional valve controlling both direction and flow rate of hydraulic fluid based on electrical input. Spring-centered spools ensure neutral position return. Subplate mounting with optional electrical position feedback for closed-loop control. Optional integrated electronics for simplified installation. Exceptional flow capacity up to 3000 L/min with maximum operating pressure up to 350 bar. Compliant with DIN 24 340 Form A, ISO 4401, and CETOP-RP121H standards. High-performance solution for general hydraulic systems requiring proportional directional control.",
          "applications": "General hydraulic systems.",
          "differentiator": "Controls both direction and flow rate of hydraulic fluid, with high flow rate capabilities.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-4WR-pilot-operated-proportional-directional-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 3000 L/min",
            "standards": "DIN 24 340 From A, ISO4401, CETOP-RP121H"
          }
        },
        {
          "name": "HD-DBE/DBEM Proportional Pressure Relief Valve",
          "tech_tier": "High",
          "size_interface": "NG10, NG20, NG30",
          "control": "Proportional solenoid",
          "features": "Subplate mounting, manifold mounting, optional integrated electronics (OBE).",
          "applications": "General hydraulic systems.",
          "differentiator": "Limits and precisely adjusts pressure based on an electrical command value, with optional maximum pressure safety (DBEM).",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DBE-DBEM-proportional-pressure-relief-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 600 L/min",
            "standards": "DIN 24 340 form E, ISO 6264"
          }
        },
        {
          "name": "HD-3DREP6 Proportional Pressure Reducing Valve, 3-Way",
          "tech_tier": "High",
          "size_interface": "NG6",
          "control": "Directly actuated proportional solenoid",
          "features": "3-way design, sub-plate mounting, optional integrated control electronics (HD-3DREPE).",
          "applications": "General hydraulic systems.",
          "differentiator": "Converts an electrical input signal into a proportional pressure output signal, limiting system pressure.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-3DREP6-proportional-pressure-reducing-valve-3-way-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 100 bar",
            "max_flow_rate": "Up to 15 L/min"
          }
        },
        {
          "name": "HD-4WRA Direct Actuated Proportional Directional Valve",
          "tech_tier": "High",
          "size_interface": "NG6, NG10",
          "control": "Directly actuated proportional solenoid",
          "features": "Spring-centered spool, subplate mounting, optional internal amplifier (HD-4WRAE).",
          "applications": "Equipment building, mining, metallurgy, aerospace, machine tools, and light industry.",
          "differentiator": "Controls both direction and volume flow of hydraulic fluid.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-4WRA-direct-actuated-proportional-directional-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 95 L/min"
          }
        },
        {
          "name": "HD-4WRE Direct Actuated Proportional Directional Valve w/ Electrical Feedback",
          "tech_tier": "High",
          "size_interface": "NG6, NG10",
          "control": "Directly actuated proportional solenoid with electrical feedback",
          "features": "Spring-centered spool, sub-plate mounting, optional integrated valve electronics (HD-4WREE).",
          "applications": "Equipment manufacturing, mining, metallurgy, and aerospace.",
          "differentiator": "Precise control of both direction and volume flow of hydraulic fluid with electrical position feedback.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-4WRE-direct-actuated-proportional-directional-valve-w-electrical-feedback-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 180 L/min",
            "standards": "ISO 4401"
          }
        },
        {
          "name": "4WRPEH6/10 Servo Solenoid Proportional Valve",
          "tech_tier": "Servo",
          "size_interface": "NG6, NG10",
          "control": "Servo solenoid with integrated electronics (OBE)",
          "features": "High-response, direct-operated, electrical position feedback, 4/4 fail-safe position.",
          "applications": "Electro-hydraulic control systems for production and testing, industrial equipment, chemical processing, mining.",
          "differentiator": "Servo quality control spool and sleeve for precise control, compatible with Bosch Rexroth's 4WRPEH series.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/4WRPEH6-10-servo-solenoid-proportional-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "nominal_flow_rate": "Up to 100 L/min",
            "standards": "DIN 24 340 A, ISO 4401, CETOP-RP 121 H"
          }
        },
        {
          "name": "LSPV Series Load Sensing Proportional Control Valve",
          "tech_tier": "High",
          "size_interface": "Modular design",
          "control": "Load sensing proportional control",
          "features": "Dynamically adjusts hydraulic flow based on the load, modular design.",
          "applications": "Construction equipment, agricultural machinery, aerial work platforms, cranes, drilling rigs, and mining trucks.",
          "differentiator": "Optimizes hydraulic system performance by providing precise, efficient, and safe flow control, minimizing energy waste.",
          "image": "https://thmhuade.com/wp-content/uploads/2023/09/LSPV-Series-Load-Sensing-Proportional-Control-valve-300x300.jpg",
          "specifications": {
            "system_compatibility": "Closed-center systems for load sensing variable pumps and open-center systems for fixed displacement pumps."
          }
        }
      ]
    },
    {
      "name": "Flow Control Valves",
      "products": [
        {
          "name": "HD-2FRM 2-Way Flow Control Valve",
          "tech_tier": "Mid",
          "size_interface": "NG5, NG6, NG10, NG16",
          "control": "Mechanical actuation",
          "features": "Subplate mounting, optional lockable key/rotary knob, optional check valve.",
          "applications": "General hydraulic systems for throttling flow.",
          "differentiator": "Maintains a constant flow, largely independent of pressure and temperature variations.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-2FRM-2-way-flow-control-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 160 L/min",
            "standards": "DIN 24 340, ISO 4401, CETOP-RP 121H"
          }
        },
        {
          "name": "HD-DV/DRV Throttle Check Valve",
          "tech_tier": "Entry to Mid",
          "size_interface": "NG6 to NG40",
          "control": "Throttle/shut-off (DV) or throttle check (DRV)",
          "features": "Sub-plate mounting or threaded connections, color scale on adjustment knob for repeatability.",
          "applications": "Industrial and mobile hydraulic systems for accurate flow control, regulating speed of loads, system damping, and pressure release in accumulator systems.",
          "differentiator": "Precise adjustment and complete shut-off of fluid flow in both directions (DV) or throttling in one direction with free return flow (DRV).",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-DV-DRV-throttle-check-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 600 L/min"
          }
        },
        {
          "name": "HD-FD Check Q Meter Valve",
          "tech_tier": "High",
          "size_interface": "NG12, NG16, NG25, NG32",
          "control": "Pilot-operated check valve",
          "features": "Sub-plate mounting, threaded connections, manifold mounting, optional built-in secondary pressure relief valve.",
          "applications": "Construction machinery, cranes, excavators, material handlers, drilling rigs, and stationary equipment.",
          "differentiator": "Controls the returning flow in relation to the flow directed into the opposite side of the actuator, preventing uncontrolled movement.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-FD-check-Q-meter-valve-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 350 bar",
            "max_flow_rate": "Up to 560 L/min",
            "standards": "DIN 24 340, ISO 5781, CETOP-RP 121 H"
          }
        },
        {
          "name": "HD-MG/MK Throttle and Throttle Check Valve (In-line mounting)",
          "tech_tier": "Entry to Mid",
          "size_interface": "NG6 to NG30",
          "control": "Throttle (MG) or throttle check (MK)",
          "features": "Direct in-line mounting with threaded connections.",
          "applications": "General hydraulic systems.",
          "differentiator": "Pressure and viscosity dependent flow control, with throttling in both directions (MG) or one direction with free return flow (MK).",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-MG-MK-throttle-and-throttle-check-valve-in-line-mounting-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 400 L/min"
          }
        },
        {
          "name": "HD-Z2FS Double Throttle Check Valve (Sandwich Plate)",
          "tech_tier": "Mid",
          "size_interface": "NG6, NG10, NG16, NG22",
          "control": "Double throttle/check valve",
          "features": "Sandwich plate design, two symmetrically arranged throttle/check valves, meter-in or meter-out control.",
          "applications": "Regulating the speed of an actuator or as a pilot choke adjustment.",
          "differentiator": "Limits main or pilot oil flow at one or two service ports.",
          "image": "https://thmhuade.com/wp-content/uploads/2020/07/HD-Z2FS-double-throttle-check-valve-sandwich-plate-300x300.jpg",
          "specifications": {
            "max_operating_pressure": "Up to 315 bar",
            "max_flow_rate": "Up to 350 L/min",
            "standards": "DIN 24 340, ISO 4401, CETOP-RP 121H"
          }
        }
      ]
    }
  ]
}